# Bài tập 8:
def vnm_to_eng_word(input_word):
    # Tạo một từ điển với các cặp ký tự tiếng Việt và tiếng Anh tương ứng
    char_map = {
        'á': 'a', 'à': 'a', 'ả': 'a', 'ã': 'a', 'ạ': 'a',
        'ắ': 'aw', 'ằ': 'aw', 'ẳ': 'aw', 'ẵ': 'aw', 'ặ': 'aw', 'â': 'aa',
        'é': 'e', 'è': 'e', 'ẻ': 'e', 'ẽ': 'e', 'ẹ': 'e',
        'ế': 'ee', 'ề': 'ee', 'ể': 'ee', 'ễ': 'ee', 'ệ': 'ee',
        'í': 'i', 'ì': 'i', 'ỉ': 'i', 'ĩ': 'i', 'ị': 'i',
        'ó': 'o', 'ò': 'o', 'ỏ': 'o', 'õ': 'o', 'ọ': 'o',
        'ơ': 'ow', 'ờ': 'ow', 'ở': 'ow', 'ớ': 'ow', 'ợ': 'ow', 'ỡ': 'ow', 'ô': 'oo',
        'ố': 'oo', 'ồ': 'oo', 'ổ': 'oo', 'ỗ': 'oo', 'ộ': 'oo',
        'ú': 'u', 'ù': 'u', 'ủ': 'u', 'ũ': 'u', 'ụ': 'u',
        'ứ': 'uw', 'ừ': 'uw', 'ử': 'uw', 'ữ': 'uw', 'ự': 'uw',
        'ý': 'y', 'ỳ': 'y', 'ỷ': 'y', 'ỹ': 'y', 'ỵ': 'y',
        'đ': 'dd',
        'Á': 'A', 'À': 'A', 'Ả': 'A', 'Ã': 'A', 'Ạ': 'A',
        'Ắ': 'AW', 'Ằ': 'AW', 'Ẳ': 'AW', 'Ẵ': 'AW', 'Ặ': 'AW', 'Â': 'AA',
        'É': 'E', 'È': 'E', 'Ẻ': 'E', 'Ẽ': 'E', 'Ẹ': 'E',
        'Ế': 'EE', 'Ề': 'EE', 'Ể': 'EE', 'Ễ': 'EE', 'Ệ': 'EE',
        'Í': 'I', 'Ì': 'I', 'Ỉ': 'I', 'Ĩ': 'I', 'Ị': 'I',
        'Ó': 'O', 'Ò': 'O', 'Ỏ': 'O', 'Õ': 'O', 'Ọ': 'O',
        'Ơ': 'OW', 'Ờ': 'OW', 'Ở': 'OW', 'Ớ': 'OW', 'Ợ': 'OW', 'Ỡ': 'OW', 'Ô': 'OO',
        'Ố': 'OO', 'Ồ': 'OO', 'Ổ': 'OO', 'Ỗ': 'OO', 'Ộ': 'OO',
        'Ú': 'U', 'Ù': 'U', 'Ủ': 'U', 'Ũ': 'U', 'Ụ': 'U',
        'Ứ': 'UW', 'Ừ': 'UW', 'Ử': 'UW', 'Ữ': 'UW', 'Ự': 'UW',
        'Ý': 'Y', 'Ỳ': 'Y', 'Ỷ': 'Y', 'Ỹ': 'Y', 'Ỵ': 'Y',
        'Đ': 'DD'

    }
    sign_map = {
        'á': 's', 'à': 'f', 'ả': 'r', 'ã': 'x', 'ạ': 'j',
        'ắ': 's', 'ằ': 'f', 'ẳ': 'r', 'ẵ': 'x', 'ặ': 'j', 
        'é': 's', 'è': 'f', 'ẻ': 'r', 'ẽ': 'x', 'ẹ': 'j',
        'ế': 's', 'ề': 'f', 'ể': 'r', 'ễ': 'x', 'ệ': 'j',
        'í': 's', 'ì': 'f', 'ỉ': 'r', 'ĩ': 'x', 'ị': 'j',
        'ó': 's', 'ò': 'f', 'ỏ': 'r', 'õ': 'x', 'ọ': 'j',
        'ơ': 'ow', 'ờ': 'f', 'ở': 'r', 'ớ': 's', 'ợ': 'j', 'ỡ': 'x',
        'ố': 's', 'ồ': 'f', 'ổ': 'r', 'ỗ': 'x', 'ộ': 'j',
        'ú': 's', 'ù': 'f', 'ủ': 'r', 'ũ': 'x', 'ụ': 'j',
        'ứ': 's', 'ừ': 'f', 'ử': 'r', 'ữ': 'x', 'ự': 'j',
        'ý': 's', 'ỳ': 'f', 'ỷ': 'r', 'ỹ': 'x', 'ỵ': 'j',
        'Á': 'S', 'À': 'F', 'Ả': 'R', 'Ã': 'X', 'Ạ': 'J',
        'Ắ': 'S', 'Ằ': 'F', 'Ẳ': 'R', 'Ẵ': 'X', 'Ặ': 'J',
        'É': 'S', 'È': 'F', 'Ẻ': 'R', 'Ẽ': 'X', 'Ẹ': 'J',
        'Ế': 'S', 'Ề': 'F', 'Ể': 'R', 'Ễ': 'X', 'Ệ': 'J',
        'Í': 'S', 'Ì': 'F', 'Ỉ': 'R', 'Ĩ': 'X', 'Ị': 'J',
        'Ó': 'S', 'Ò': 'F', 'Ỏ': 'R', 'Õ': 'X', 'Ọ': 'J',
        'Ơ': 'OW', 'Ờ': 'F', 'Ở': 'R', 'Ớ': 'S', 'Ợ': 'J', 'Ỡ': 'X',
        'Ố': 'S', 'Ồ': 'F', 'Ổ': 'R', 'Ỗ': 'X', 'Ộ': 'J',
        'Ú': 'S', 'Ù': 'F', 'Ủ': 'R', 'Ũ': 'X', 'Ụ': 'J',
        'Ứ': 'S', 'Ừ': 'F', 'Ử': 'R', 'Ữ': 'X', 'Ự': 'J',
        'Ý': 'S', 'Ỳ': 'F', 'Ỷ': 'R', 'Ỹ': 'X', 'Ỵ': 'J',
    }

    # Chuyển đổi từng ký tự trong input_word
    output_str = ''
    for char in input_word:
        if char in char_map:
            output_str += char_map[char]
        else:
            output_str += char
    
    for char in input_word:
        if char in sign_map:
            output_str += sign_map[char]
    

    return output_str 

def vnm_to_eng_str(input_str):
    list_temp = input_str.split(" ")
    for i in range(len(list_temp)):
        list_temp[i] = vnm_to_eng_word(list_temp[i])
    output = " ".join(list_temp)
    return output

# Kiểm tra chuyển đổi vnm to eng
input_str = "Nguyễn Tiến Đạt"
print(vnm_to_eng_str(input_str))

